package com.example.mss.application.common.dto;

import java.util.Map;

/**
 * packageName  : com.example.mss.application.common.dto
 * fileName     : InitUtil
 * auther       : zero
 * date         : 2025. 1. 11.
 * descriptuon  :
 * =======================================================
 * DATE         AUTHER              NOTE
 * -------------------------------------------------------
 * 2025. 1. 11.      zero             최초생성
 */
public class InitUtil {
    public static Map<String, Map<String, Integer>> productMap() {
        return Map.of(
                "A", Map.of(
                        "상의", 11200, "아우터", 5500
                        , "바지", 4200, "스니커즈", 9000
                        , "가방", 2000, "모자", 1700
                        , "양말", 1800, "액세서리", 2300)
                , "B", Map.of(
                        "상의", 10500, "아우터", 5900
                        , "바지", 3800, "스니커즈", 9100
                        , "가방", 2100, "모자", 2000
                        , "양말", 2000, "액세서리", 2200)
                , "C", Map.of(
                        "상의", 10000, "아우터", 6200
                        , "바지", 3300, "스니커즈", 9200
                        , "가방", 2200, "모자", 1900
                        , "양말", 2200, "액세서리", 2100)
                , "D", Map.of(
                        "상의", 10100, "아우터", 5100
                        , "바지", 3000, "스니커즈", 9500
                        , "가방", 2500, "모자", 1500
                        , "양말", 2400, "액세서리", 2000)
                , "E", Map.of(
                        "상의", 10700, "아우터", 5000
                        , "바지", 3800, "스니커즈", 9900
                        , "가방", 2300, "모자", 1800
                        , "양말", 2100, "액세서리", 2100)
                , "F", Map.of(
                        "상의", 11200, "아우터", 7200
                        , "바지", 4000, "스니커즈", 9300
                        , "가방", 2100, "모자", 1600
                        , "양말", 2300, "액세서리", 1900)
                , "G", Map.of(
                        "상의", 10500, "아우터", 5800
                        , "바지", 3900, "스니커즈", 9000
                        , "가방", 2200, "모자", 1700
                        , "양말", 2100, "액세서리", 2000)
                , "H", Map.of(
                        "상의", 10800, "아우터", 6300
                        , "바지", 3100, "스니커즈", 9700
                        , "가방", 2100, "모자", 1600
                        , "양말", 2000, "액세서리", 2000)
                , "I", Map.of(
                        "상의", 11400, "아우터", 6700
                        , "바지", 3200, "스니커즈", 9500
                        , "가방", 2400, "모자", 1700
                        , "양말", 1700, "액세서리", 2400)
        );
    }
}
